Page({
    data: {
      civil: [
        {
          title: "第二百八十八条",
          content:
            "不动产的相邻权利人应当按照有利生产、方便生活、团结互助、公平合理的原则，正确处理相邻关系。",
        },
        {
          title: "第二百八十九条",
          content:
            ["法律、法规对处理相邻关系有规定的，依照其规定；法律、法规没有规定的，可以按照当地习惯。","国家巩固和发展公有制经济，鼓励、支持和引导非公有制经济的发展。","国家实行社会主义市场经济，保障一切市场主体的平等法律地位和发展权利。"],
        },
        {
          title: "第二百九十条",
          content:
          ["不动产权利人应当为相邻权利人用水、排水提供必要的便利。","对自然流水的利用，应当在不动产的相邻权利人之间合理分配。对自然流水的排放，应当尊重自然流向。"],
        },
        {
          title: "第二百九十一条",
          content:
            "不动产权利人对相邻权利人因通行等必须利用其土地的，应当提供必要的便利。",
        },
        {
            title: "第二百九十二条",
            content:
              "不动产权利人因建造、修缮建筑物以及铺设电线、电缆、水管、暖气和燃气管线等必须利用相邻土地、建筑物的，该土地、建筑物的权利人应当提供必要的便利。",
        },
        {
            title: "第二百九十三条",
            content:
              "建造建筑物，不得违反国家有关工程建设标准，不得妨碍相邻建筑物的通风、采光和日照。",
        },
        {
            title: "第二百九十四条",
            content:
              "不动产权利人不得违反国家规定弃置固体废物，排放大气污染物、水污染物、土壤污染物、噪声、光辐射、电磁辐射等有害物质。",
        },
        {
            title: "第二百九十五条",
            content:
              "不动产权利人挖掘土地、建造建筑物、铺设管线以及安装设备等，不得危及相邻不动产的安全。",
        },
        {
            title: "第二百九十六条",
            content:
              "不动产权利人因用水、排水、通行、铺设管线等利用相邻不动产的，应当尽量避免对相邻的不动产权利人造成损害。",
        },
        ],
      },
    });