Page({
  data: {
    civil: [
      {
        title: "第五百四十三条",
        content: "当事人协商一致，可以变更合同。",
      },
      {
        title: "第五百四十四条",
        content: "当事人对合同变更的内容约定不明确的，推定为未变更。",
      },
      {
        title: "第五百四十五条",
        content: [
          "债权人可以将债权的全部或者部分转让给第三人，但是有下列情形之一的除外：",
          "（一）根据债权性质不得转让；",
          "（二）按照当事人约定不得转让；",
          "（三）依照法律规定不得转让。",
          "当事人约定非金钱债权不得转让的，不得对抗善意第三人。当事人约定金钱债权不得转让的，不得对抗第三人。",
        ],
      },
      {
        title: "第五百四十六条",
        content: [
          "债权人转让债权，未通知债务人的，该转让对债务人不发生效力。",
          "债权转让的通知不得撤销，但是经受让人同意的除外。",
        ],
      },
      {
        title: "第五百四十七条",
        content: [
          "债权人转让债权的，受让人取得与债权有关的从权利，但是该从权利专属于债权人自身的除外。",
          "受让人取得从权利不因该从权利未办理转移登记手续或者未转移占有而受到影响。",
        ],
      },
      {
        title: "第五百四十八条",
        content:
          "债务人接到债权转让通知后，债务人对让与人的抗辩，可以向受让人主张。",
      },
      {
        title: "第五百四十九条",
        content: [
          "有下列情形之一的，债务人可以向受让人主张抵销：",
          "（一）债务人接到债权转让通知时，债务人对让与人享有债权，且债务人的债权先于转让的债权到期或者同时到期；",
          "（二）债务人的债权与转让的债权是基于同一合同产生。",
        ],
      },
      {
        title: "第五百五十条",
        content: "因债权转让增加的履行费用，由让与人负担。",
      },
      {
        title: "第五百五十一条",
        content: [
          "债务人将债务的全部或者部分转移给第三人的，应当经债权人同意。",
          "债务人或者第三人可以催告债权人在合理期限内予以同意，债权人未作表示的，视为不同意。",
        ],
      },
      {
        title: "第五百五十二条",
        content:
          "第三人与债务人约定加入债务并通知债权人，或者第三人向债权人表示愿意加入债务，债权人未在合理期限内明确拒绝的，债权人可以请求第三人在其愿意承担的债务范围内和债务人承担连带债务。",
      },
      {
        title: "第五百五十三条",
        content:
          "债务人转移债务的，新债务人可以主张原债务人对债权人的抗辩；原债务人对债权人享有债权的，新债务人不得向债权人主张抵销。",
      },
      {
        title: "第五百五十四条",
        content:
          "债务人转移债务的，新债务人应当承担与主债务有关的从债务，但是该从债务专属于原债务人自身的除外。",
      },
      {
        title: "第五百五十五条",
        content:
          "当事人一方经对方同意，可以将自己在合同中的权利和义务一并转让给第三人。",
      },
      {
        title: "第五百五十六条",
        content:
          "合同的权利和义务一并转让的，适用债权转让、债务转移的有关规定。",
      },
    ],
  },
});
