Page({
  data: {
    civil: [
      {
        title: "第七百三十五条",
        content:
          "融资租赁合同是出租人根据承租人对出卖人、租赁物的选择，向出卖人购买租赁物，提供给承租人使用，承租人支付租金的合同。",
      },
      {
        title: "第七百三十六条",
        content: [
          "融资租赁合同的内容一般包括租赁物的名称、数量、规格、技术性能、检验方法，租赁期限，租金构成及其支付期限和方式、币种，租赁期限届满租赁物的归属等条款。",
          "融资租赁合同应当采用书面形式。",
        ],
      },
      {
        title: "第七百三十七条",
        content: "当事人以虚构租赁物方式订立的融资租赁合同无效。",
      },
      {
        title: "第七百三十八条",
        content:
          "依照法律、行政法规的规定，对于租赁物的经营使用应当取得行政许可的，出租人未取得行政许可不影响融资租赁合同的效力。",
      },
      {
        title: "第七百三十九条",
        content:
          "出租人根据承租人对出卖人、租赁物的选择订立的买卖合同，出卖人应当按照约定向承租人交付标的物，承租人享有与受领标的物有关的买受人的权利。",
      },
      {
        title: "第七百四十条",
        content: [
          "出卖人违反向承租人交付标的物的义务，有下列情形之一的，承租人可以拒绝受领出卖人向其交付的标的物：",
          "（一）标的物严重不符合约定；",
          "（二）未按照约定交付标的物，经承租人或者出租人催告后在合理期限内仍未交付。",
          "承租人拒绝受领标的物的，应当及时通知出租人。",
        ],
      },
      {
        title: "第七百四十一条",
        content:
          "出租人、出卖人、承租人可以约定，出卖人不履行买卖合同义务的，由承租人行使索赔的权利。承租人行使索赔权利的，出租人应当协助。",
      },
      {
        title: "第七百四十二条",
        content:
          "承租人对出卖人行使索赔权利，不影响其履行支付租金的义务。但是，承租人依赖出租人的技能确定租赁物或者出租人干预选择租赁物的，承租人可以请求减免相应租金。",
      },
      {
        title: "第七百四十三条",
        content: [
          "出租人有下列情形之一，致使承租人对出卖人行使索赔权利失败的，承租人有权请求出租人承担相应的责任：",
          "（一）明知租赁物有质量瑕疵而不告知承租人；",
          "（二）承租人行使索赔权利时，未及时提供必要协助。",
          "出租人怠于行使只能由其对出卖人行使的索赔权利，造成承租人损失的，承租人有权请求出租人承担赔偿责任。",
        ],
      },
      {
        title: "第七百四十四条",
        content:
          "出租人根据承租人对出卖人、租赁物的选择订立的买卖合同，未经承租人同意，出租人不得变更与承租人有关的合同内容。",
      },
      {
        title: "第七百四十五条",
        content: "出租人对租赁物享有的所有权，未经登记，不得对抗善意第三人。",
      },
      {
        title: "第七百四十六条",
        content:
          "融资租赁合同的租金，除当事人另有约定外，应当根据购买租赁物的大部分或者全部成本以及出租人的合理利润确定。",
      },
      {
        title: "第七百四十七条",
        content:
          "租赁物不符合约定或者不符合使用目的的，出租人不承担责任。但是，承租人依赖出租人的技能确定租赁物或者出租人干预选择租赁物的除外。",
      },
      {
        title: "第七百四十八条",
        content: [
          "出租人应当保证承租人对租赁物的占有和使用。",
          "出租人有下列情形之一的，承租人有权请求其赔偿损失：",
          "（一）无正当理由收回租赁物；",
          "（二）无正当理由妨碍、干扰承租人对租赁物的占有和使用；",
          "（三）因出租人的原因致使第三人对租赁物主张权利；",
          "（四）不当影响承租人对租赁物占有和使用的其他情形。",
        ],
      },
      {
        title: "第七百四十九条",
        content:
          "承租人占有租赁物期间，租赁物造成第三人人身损害或者财产损失的，出租人不承担责任。",
      },
      {
        title: "第七百五十条",
        content: [
          "承租人应当妥善保管、使用租赁物。",
          "承租人应当履行占有租赁物期间的维修义务。",
        ],
      },
      {
        title: "第七百五十一条",
        content:
          "承租人占有租赁物期间，租赁物毁损、灭失的，出租人有权请求承租人继续支付租金，但是法律另有规定或者当事人另有约定的除外。",
      },
      {
        title: "第七百五十二条",
        content:
          "承租人应当按照约定支付租金。承租人经催告后在合理期限内仍不支付租金的，出租人可以请求支付全部租金；也可以解除合同，收回租赁物。",
      },
      {
        title: "第七百五十三条",
        content:
          "承租人未经出租人同意，将租赁物转让、抵押、质押、投资入股或者以其他方式处分的，出租人可以解除融资租赁合同。",
      },
      {
        title: "第七百五十四条",
        content: [
          "有下列情形之一的，出租人或者承租人可以解除融资租赁合同：",
          "（一）出租人与出卖人订立的买卖合同解除、被确认无效或者被撤销，且未能重新订立买卖合同；",
          "（二）租赁物因不可归责于当事人的原因毁损、灭失，且不能修复或者确定替代物；",
          "（三）因出卖人的原因致使融资租赁合同的目的不能实现。",
        ],
      },
      {
        title: "第七百五十五条",
        content: [
          "融资租赁合同因买卖合同解除、被确认无效或者被撤销而解除，出卖人、租赁物系由承租人选择的，出租人有权请求承租人赔偿相应损失；但是，因出租人原因致使买卖合同解除、被确认无效或者被撤销的除外。",
          "出租人的损失已经在买卖合同解除、被确认无效或者被撤销时获得赔偿的，承租人不再承担相应的赔偿责任。",
        ],
      },
      {
        title: "第七百五十六条",
        content:
          "融资租赁合同因租赁物交付承租人后意外毁损、灭失等不可归责于当事人的原因解除的，出租人可以请求承租人按照租赁物折旧情况给予补偿。",
      },
      {
        title: "第七百五十七条",
        content:
          "出租人和承租人可以约定租赁期限届满租赁物的归属；对租赁物的归属没有约定或者约定不明确，依据本法第五百一十条的规定仍不能确定的，租赁物的所有权归出租人。",
      },
      {
        title: "第七百五十八条",
        content: [
          "当事人约定租赁期限届满租赁物归承租人所有，承租人已经支付大部分租金，但是无力支付剩余租金，出租人因此解除合同收回租赁物，收回的租赁物的价值超过承租人欠付的租金以及其他费用的，承租人可以请求相应返还。",
          "当事人约定租赁期限届满租赁物归出租人所有，因租赁物毁损、灭失或者附合、混合于他物致使承租人不能返还的，出租人有权请求承租人给予合理补偿。",
        ],
      },
      {
        title: "第七百五十九条",
        content:
          "当事人约定租赁期限届满，承租人仅需向出租人支付象征性价款的，视为约定的租金义务履行完毕后租赁物的所有权归承租人。",
      },
      {
        title: "第七百六十条",
        content:
          "融资租赁合同无效，当事人就该情形下租赁物的归属有约定的，按照其约定；没有约定或者约定不明确的，租赁物应当返还出租人。但是，因承租人原因致使合同无效，出租人不请求返还或者返还后会显著降低租赁物效用的，租赁物的所有权归承租人，由承租人给予出租人合理补偿。",
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
