Page({
    data: {
      civil: [
        {
          title: "第四百六十三条",
          content:
            "本编调整因合同产生的民事关系。",
        },
        {
          title: "第四百六十四条",
          content:
            ["合同是民事主体之间设立、变更、终止民事法律关系的协议。","婚姻、收养、监护等有关身份关系的协议，适用有关该身份关系的法律规定；没有规定的，可以根据其性质参照适用本编规定。"],
        },
        {
          title: "第四百六十五条",
          content:
          ["依法成立的合同，受法律保护。","依法成立的合同，仅对当事人具有法律约束力，但是法律另有规定的除外。"],
        },
        {
          title: "第四百六十六条",
          content:
          ["当事人对合同条款的理解有争议的，应当依据本法第一百四十二条第一款的规定，确定争议条款的含义。","合同文本采用两种以上文字订立并约定具有同等效力的，对各文本使用的词句推定具有相同含义。各文本使用的词句不一致的，应当根据合同的相关条款、性质、目的以及诚信原则等予以解释。"],
        },
        {
            title: "第四百六十七条",
            content:
            ["本法或者其他法律没有明文规定的合同，适用本编通则的规定，并可以参照适用本编或者其他法律最相类似合同的规定。","在中华人民共和国境内履行的中外合资经营企业合同、中外合作经营企业合同、中外合作勘探开发自然资源合同，适用中华人民共和国法律。"],
          },
          {
            title: "第四百六十八条",
            content:
              "非因合同产生的债权债务关系，适用有关该债权债务关系的法律规定；没有规定的，适用本编通则的有关规定，但是根据其性质不能适用的除外。",
          },
        ],
      },
    });