Page({
  data: {
    civil: [
      {
        title: "第二百零五条",
        content:
          "本编调整因物的归属和利用产生的民事关系。",
      },
      {
        title: "第二百零六条",
        content:
          ["国家坚持和完善公有制为主体、多种所有制经济共同发展，按劳分配为主体、多种分配方式并存，社会主义市场经济体制等社会主义基本经济制度。","国家巩固和发展公有制经济，鼓励、支持和引导非公有制经济的发展。","国家实行社会主义市场经济，保障一切市场主体的平等法律地位和发展权利。"],
      },
      {
        title: "第二百零七条",
        content:
          "国家、集体、私人的物权和其他权利人的物权受法律平等保护，任何组织或者个人不得侵犯。",
      },
      {
        title: "第二百零八条",
        content:
          "不动产物权的设立、变更、转让和消灭，应当依照法律规定登记。动产物权的设立和转让，应当依照法律规定交付。",
      },
      ],
    },
  });