Page({
  data: {
    civil: [
      {
        title: "第一百零二条",
        content: [
          "非法人组织是不具有法人资格，但是能够依法以自己的名义从事民事活动的组织。",
          "非法人组织包括个人独资企业、合伙企业、不具有法人资格的专业服务机构等。",
        ],
      },
      {
        title: "第一百零三条",
        content: [
          "非法人组织应当依照法律的规定登记。",
          "设立非法人组织，法律、行政法规规定须经有关机关批准的，依照其规定。",
        ],
      },
      {
        title: "第一百零四条",
        content:
          "非法人组织的财产不足以清偿债务的，其出资人或者设立人承担无限责任。法律另有规定的，依照其规定。",
      },
      {
        title: "第一百零五条",
        content: "非法人组织可以确定一人或者数人代表该组织从事民事活动。",
      },
      {
        title: "第一百零六条",
        content: [
          "有下列情形之一的，非法人组织解散：",
          "（一）章程规定的存续期间届满或者章程规定的其他解散事由出现；",
          "（二）出资人或者设立人决定解散；",
          "（三）法律规定的其他情形。",
        ],
      },
      {
        title: "第一百零七条",
        content: "非法人组织解散的，应当依法进行清算。",
      },
      {
        title: "第一百零八条",
        content:
          "非法人组织除适用本章规定外，参照适用本编第三章第一节的有关规定。",
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
