Page({
  data: {
    civil: [
      {
        title: "第七百八十八条",
        content: [
          "建设工程合同是承包人进行工程建设，发包人支付价款的合同。",
          "建设工程合同包括工程勘察、设计、施工合同。",
        ],
      },
      {
        title: "第七百八十九条",
        content: "建设工程合同应当采用书面形式。",
      },
      {
        title: "第七百九十条",
        content:
          "建设工程的招标投标活动，应当依照有关法律的规定公开、公平、公正进行。",
      },
      {
        title: "第七百九十一条",
        content: [
          "发包人可以与总承包人订立建设工程合同，也可以分别与勘察人、设计人、施工人订立勘察、设计、施工承包合同。发包人不得将应当由一个承包人完成的建设工程支解成若干部分发包给数个承包人。",
          "总承包人或者勘察、设计、施工承包人经发包人同意，可以将自己承包的部分工作交由第三人完成。第三人就其完成的工作成果与总承包人或者勘察、设计、施工承包人向发包人承担连带责任。承包人不得将其承包的全部建设工程转包给第三人或者将其承包的全部建设工程支解以后以分包的名义分别转包给第三人。",
          "禁止承包人将工程分包给不具备相应资质条件的单位。禁止分包单位将其承包的工程再分包。建设工程主体结构的施工必须由承包人自行完成。",
        ],
      },
      {
        title: "第七百九十二条",
        content:
          "国家重大建设工程合同，应当按照国家规定的程序和国家批准的投资计划、可行性研究报告等文件订立。",
      },
      {
        title: "第七百九十三条",
        content: [
          "建设工程施工合同无效，但是建设工程经验收合格的，可以参照合同关于工程价款的约定折价补偿承包人。",
          "建设工程施工合同无效，且建设工程经验收不合格的，按照以下情形处理：",
          "（一）修复后的建设工程经验收合格的，发包人可以请求承包人承担修复费用；",
          "（二）修复后的建设工程经验收不合格的，承包人无权请求参照合同关于工程价款的约定折价补偿。",
          "发包人对因建设工程不合格造成的损失有过错的，应当承担相应的责任。",
        ],
      },
      {
        title: "第七百九十四条",
        content:
          "勘察、设计合同的内容一般包括提交有关基础资料和概预算等文件的期限、质量要求、费用以及其他协作条件等条款。",
      },
      {
        title: "第七百九十五条",
        content:
          "施工合同的内容一般包括工程范围、建设工期、中间交工工程的开工和竣工时间、工程质量、工程造价、技术资料交付时间、材料和设备供应责任、拨款和结算、竣工验收、质量保修范围和质量保证期、相互协作等条款。",
      },
      {
        title: "第七百九十六条",
        content:
          "建设工程实行监理的，发包人应当与监理人采用书面形式订立委托监理合同。发包人与监理人的权利和义务以及法律责任，应当依照本编委托合同以及其他有关法律、行政法规的规定。",
      },
      {
        title: "第七百九十七条",
        content:
          "发包人在不妨碍承包人正常作业的情况下，可以随时对作业进度、质量进行检查。",
      },
      {
        title: "第七百九十八条",
        content:
          "隐蔽工程在隐蔽以前，承包人应当通知发包人检查。发包人没有及时检查的，承包人可以顺延工程日期，并有权请求赔偿停工、窝工等损失。",
      },
      {
        title: "第七百九十九条",
        content: [
          "建设工程竣工后，发包人应当根据施工图纸及说明书、国家颁发的施工验收规范和质量检验标准及时进行验收。验收合格的，发包人应当按照约定支付价款，并接收该建设工程。",
          "建设工程竣工经验收合格后，方可交付使用；未经验收或者验收不合格的，不得交付使用。",
        ],
      },
      {
        title: "第八百条",
        content:
          "勘察、设计的质量不符合要求或者未按照期限提交勘察、设计文件拖延工期，造成发包人损失的，勘察人、设计人应当继续完善勘察、设计，减收或者免收勘察、设计费并赔偿损失。",
      },
      {
        title: "第八百零一条",
        content:
          "因施工人的原因致使建设工程质量不符合约定的，发包人有权请求施工人在合理期限内无偿修理或者返工、改建。经过修理或者返工、改建后，造成逾期交付的，施工人应当承担违约责任。",
      },
      {
        title: "第八百零二条",
        content:
          "因承包人的原因致使建设工程在合理使用期限内造成人身损害和财产损失的，承包人应当承担赔偿责任。",
      },
      {
        title: "第八百零三条",
        content:
          "发包人未按照约定的时间和要求提供原材料、设备、场地、资金、技术资料的，承包人可以顺延工程日期，并有权请求赔偿停工、窝工等损失。",
      },
      {
        title: "第八百零四条",
        content:
          "因发包人的原因致使工程中途停建、缓建的，发包人应当采取措施弥补或者减少损失，赔偿承包人因此造成的停工、窝工、倒运、机械设备调迁、材料和构件积压等损失和实际费用。",
      },
      {
        title: "第八百零五条",
        content:
          "因发包人变更计划，提供的资料不准确，或者未按照期限提供必需的勘察、设计工作条件而造成勘察、设计的返工、停工或者修改设计，发包人应当按照勘察人、设计人实际消耗的工作量增付费用。",
      },
      {
        title: "第八百零六条",
        content: [
          "承包人将建设工程转包、违法分包的，发包人可以解除合同。",
          "发包人提供的主要建筑材料、建筑构配件和设备不符合强制性标准或者不履行协助义务，致使承包人无法施工，经催告后在合理期限内仍未履行相应义务的，承包人可以解除合同。",
          "合同解除后，已经完成的建设工程质量合格的，发包人应当按照约定支付相应的工程价款；已经完成的建设工程质量不合格的，参照本法第七百九十三条的规定处理。",
        ],
      },
      {
        title: "第八百零七条",
        content:
          "发包人未按照约定支付价款的，承包人可以催告发包人在合理期限内支付价款。发包人逾期不支付的，除根据建设工程的性质不宜折价、拍卖外，承包人可以与发包人协议将该工程折价，也可以请求人民法院将该工程依法拍卖。建设工程的价款就该工程折价或者拍卖的价款优先受偿。",
      },
      {
        title: "第八百零八条",
        content: "本章没有规定的，适用承揽合同的有关规定。",
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
