Page({
  data: {
    civil: [
      {
        title: "第六百五十七条",
        content:
          "赠与合同是赠与人将自己的财产无偿给予受赠人，受赠人表示接受赠与的合同。",
      },
      {
        title: "第六百五十八条",
        content: [
          "赠与人在赠与财产的权利转移之前可以撤销赠与。",
          "经过公证的赠与合同或者依法不得撤销的具有救灾、扶贫、助残等公益、道德义务性质的赠与合同，不适用前款规定。",
        ],
      },
      {
        title: "第六百五十九条",
        content: "赠与的财产依法需要办理登记或者其他手续的，应当办理有关手续。",
      },
      {
        title: "第六百六十条",
        content: [
          "经过公证的赠与合同或者依法不得撤销的具有救灾、扶贫、助残等公益、道德义务性质的赠与合同，赠与人不交付赠与财产的，受赠人可以请求交付。",
          "依据前款规定应当交付的赠与财产因赠与人故意或者重大过失致使毁损、灭失的，赠与人应当承担赔偿责任。",
        ],
      },
      {
        title: "第六百六十一条",
        content: [
          "赠与可以附义务。",
          "赠与附义务的，受赠人应当按照约定履行义务。",
        ],
      },
      {
        title: "第六百六十二条",
        content: [
          "赠与的财产有瑕疵的，赠与人不承担责任。附义务的赠与，赠与的财产有瑕疵的，赠与人在附义务的限度内承担与出卖人相同的责任。",
          "赠与人故意不告知瑕疵或者保证无瑕疵，造成受赠人损失的，应当承担赔偿责任。",
        ],
      },
      {
        title: "第六百六十三条",
        content: [
          "受赠人有下列情形之一的，赠与人可以撤销赠与：",
          "（一）严重侵害赠与人或者赠与人近亲属的合法权益；",
          "（二）对赠与人有扶养义务而不履行；",
          "（三）不履行赠与合同约定的义务。",
          "赠与人的撤销权，自知道或者应当知道撤销事由之日起一年内行使。",
        ],
      },
      {
        title: "第六百六十四条",
        content: [
          "因受赠人的违法行为致使赠与人死亡或者丧失民事行为能力的，赠与人的继承人或者法定代理人可以撤销赠与。",
          "赠与人的继承人或者法定代理人的撤销权，自知道或者应当知道撤销事由之日起六个月内行使。",
        ],
      },
      {
        title: "第六百六十五条",
        content: "撤销权人撤销赠与的，可以向受赠人请求返还赠与的财产。",
      },
      {
        title: "第六百六十六条",
        content:
          "赠与人的经济状况显著恶化，严重影响其生产经营或者家庭生活的，可以不再履行赠与义务。",
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
