Page({
  data: {
    civil: [
      {
        title: "第一节  动产质权",
        items: [
          {
            title: "第四百二十五条",
            content: [
              "为担保债务的履行，债务人或者第三人将其动产出质给债权人占有的，债务人不履行到期债务或者发生当事人约定的实现质权的情形，债权人有权就该动产优先受偿。",
              "前款规定的债务人或者第三人为出质人，债权人为质权人，交付的动产为质押财产。",
            ],
          },
          {
            title: "第四百二十六条",
            content: "法律、行政法规禁止转让的动产不得出质。",
          },
          {
            title: "第四百二十七条",
            content: [
              "设立质权，当事人应当采用书面形式订立质押合同。",
              "质押合同一般包括下列条款：",
              "（一）被担保债权的种类和数额；",
              "（二）债务人履行债务的期限；",
              "（三）质押财产的名称、数量等情况；",
              "（四）担保的范围；",
              "（五）质押财产交付的时间、方式。",
            ],
          },
          {
            title: "第四百二十八条",
            content:
              "质权人在债务履行期限届满前，与出质人约定债务人不履行到期债务时质押财产归债权人所有的，只能依法就质押财产优先受偿。",
          },
          {
            title: "第四百二十九条",
            content: "质权自出质人交付质押财产时设立。",
          },
          {
            title: "第四百三十条",
            content: [
              "质权人有权收取质押财产的孳息，但是合同另有约定的除外。",
              "前款规定的孳息应当先充抵收取孳息的费用。",
            ],
          },
          {
            title: "第四百三十一条",
            content:
              "质权人在质权存续期间，未经出质人同意，擅自使用、处分质押财产，造成出质人损害的，应当承担赔偿责任。",
          },
          {
            title: "第四百三十二条",
            content: [
              "质权人负有妥善保管质押财产的义务；因保管不善致使质押财产毁损、灭失的，应当承担赔偿责任。",
              "质权人的行为可能使质押财产毁损、灭失的，出质人可以请求质权人将质押财产提存，或者请求提前清偿债务并返还质押财产。",
            ],
          },
          {
            title: "第四百三十三条",
            content:
              "因不可归责于质权人的事由可能使质押财产毁损或者价值明显减少，足以危害质权人权利的，质权人有权请求出质人提供相应的担保；出质人不提供的，质权人可以拍卖、变卖质押财产，并与出质人协议将拍卖、变卖所得的价款提前清偿债务或者提存。",
          },
          {
            title: "第四百三十四条",
            content:
              "质权人在质权存续期间，未经出质人同意转质，造成质押财产毁损、灭失的，应当承担赔偿责任。",
          },
          {
            title: "第四百三十五条",
            content:
              "质权人可以放弃质权。债务人以自己的财产出质，质权人放弃该质权的，其他担保人在质权人丧失优先受偿权益的范围内免除担保责任，但是其他担保人承诺仍然提供担保的除外。",
          },
          {
            title: "第四百三十六条",
            content: [
              "债务人履行债务或者出质人提前清偿所担保的债权的，质权人应当返还质押财产。",
              "债务人不履行到期债务或者发生当事人约定的实现质权的情形，质权人可以与出质人协议以质押财产折价，也可以就拍卖、变卖质押财产所得的价款优先受偿。",
              "质押财产折价或者变卖的，应当参照市场价格。",
            ],
          },
          {
            title: "第四百三十七条",
            content: [
              "出质人可以请求质权人在债务履行期限届满后及时行使质权；质权人不行使的，出质人可以请求人民法院拍卖、变卖质押财产。",
              "出质人请求质权人及时行使质权，因质权人怠于行使权利造成出质人损害的，由质权人承担赔偿责任。",
            ],
          },
          {
            title: "第四百三十八条",
            content:
              "质押财产折价或者拍卖、变卖后，其价款超过债权数额的部分归出质人所有，不足部分由债务人清偿。",
          },
          {
            title: "第四百三十九条",
            content: [
              "出质人与质权人可以协议设立最高额质权。",
              "最高额质权除适用本节有关规定外，参照适用本编第十七章第二节的有关规定。",
            ],
          },
        ],
      },
      {
        title: "第二节  权利质权",
        items: [
          {
            title: "第四百四十条",
            content: [
              "债务人或者第三人有权处分的下列权利可以出质：",
              "（一）汇票、本票、支票；",
              "（二）债券、存款单；",
              "（三）仓单、提单；",
              "（四）可以转让的基金份额、股权；",
              "（五）可以转让的注册商标专用权、专利权、著作权等知识产权中的财产权；",
              "（六）现有的以及将有的应收账款；",
              "（七）法律、行政法规规定可以出质的其他财产权利。",
            ],
          },
          {
            title: "第四百四十一条",
            content:
              "以汇票、本票、支票、债券、存款单、仓单、提单出质的，质权自权利凭证交付质权人时设立；没有权利凭证的，质权自办理出质登记时设立。法律另有规定的，依照其规定。",
          },
          {
            title: "第四百四十二条",
            content:
              "汇票、本票、支票、债券、存款单、仓单、提单的兑现日期或者提货日期先于主债权到期的，质权人可以兑现或者提货，并与出质人协议将兑现的价款或者提取的货物提前清偿债务或者提存。",
          },
          {
            title: "第四百四十三条",
            content: [
              "以基金份额、股权出质的，质权自办理出质登记时设立。",
              "基金份额、股权出质后，不得转让，但是出质人与质权人协商同意的除外。出质人转让基金份额、股权所得的价款，应当向质权人提前清偿债务或者提存。",
            ],
          },
          {
            title: "第四百四十四条",
            content: [
              "以注册商标专用权、专利权、著作权等知识产权中的财产权出质的，质权自办理出质登记时设立。",
              "知识产权中的财产权出质后，出质人不得转让或者许可他人使用，但是出质人与质权人协商同意的除外。出质人转让或者许可他人使用出质的知识产权中的财产权所得的价款，应当向质权人提前清偿债务或者提存。",
            ],
          },
          {
            title: "第四百四十五条",
            content: [
              "以应收账款出质的，质权自办理出质登记时设立。",
              "应收账款出质后，不得转让，但是出质人与质权人协商同意的除外。出质人转让应收账款所得的价款，应当向质权人提前清偿债务或者提存。",
            ],
          },
          {
            title: "第四百四十六条",
            content: "权利质权除适用本节规定外，适用本章第一节的有关规定。",
          },
        ],
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
