Page({
  data: {
    civil: [
      {
        title: "第四百五十八条",
        content:
          "基于合同关系等产生的占有，有关不动产或者动产的使用、收益、违约责任等，按照合同约定；合同没有约定或者约定不明确的，依照有关法律规定。",
      },
      {
        title: "第四百五十九条",
        content:
          "占有人因使用占有的不动产或者动产，致使该不动产或者动产受到损害的，恶意占有人应当承担赔偿责任。",
      },
      {
        title: "第四百六十条",
        content:
          "不动产或者动产被占有人占有的，权利人可以请求返还原物及其孳息；但是，应当支付善意占有人因维护该不动产或者动产支出的必要费用。",
      },
      {
        title: "第四百六十一条",
        content:
          "占有的不动产或者动产毁损、灭失，该不动产或者动产的权利人请求赔偿的，占有人应当将因毁损、灭失取得的保险金、赔偿金或者补偿金等返还给权利人；权利人的损害未得到足够弥补的，恶意占有人还应当赔偿损失。",
      },
      {
        title: "第四百六十二条",
        content: [
          "占有的不动产或者动产被侵占的，占有人有权请求返还原物；对妨害占有的行为，占有人有权请求排除妨害或者消除危险；因侵占或者妨害造成损害的，占有人有权依法请求损害赔偿。",
          "占有人返还原物的请求权，自侵占发生之日起一年内未行使的，该请求权消灭。",
        ],
      },
    ],
  },
});
