Page({
    data: {
      civil: [
        {
          title: "第三百二十三条",
          content:
            "用益物权人对他人所有的不动产或者动产，依法享有占有、使用和收益的权利。",
        },
        {
          title: "第三百二十四条",
          content:
          "国家所有或者国家所有由集体使用以及法律规定属于集体所有的自然资源，组织、个人依法可以占有、使用和收益。",
        },
        {
          title: "第三百二十五条",
          content:
            "国家实行自然资源有偿使用制度，但是法律另有规定的除外。",
        },
        {
          title: "第三百二十六条",
          content:
            "用益物权人行使权利，应当遵守法律有关保护和合理开发利用资源、保护生态环境的规定。所有权人不得干涉用益物权人行使权利。",
        },
        {
            title: "第三百二十七条",
            content:
              "因不动产或者动产被征收、征用致使用益物权消灭或者影响用益物权行使的，用益物权人有权依据本法第二百四十三条、第二百四十五条的规定获得相应补偿。",
          },
          {
            title: "第三百二十八条",
            content:
              "依法取得的海域使用权受法律保护。",
          },
          {
            title: "第三百二十九条",
            content:
              "依法取得的探矿权、采矿权、取水权和使用水域、滩涂从事养殖、捕捞的权利受法律保护。",
          },
        ],
      },
    });