Page({
    data: {
      civil: [
        {
          title: "第三百六十六条",
          content:
            "居住权人有权按照合同约定，对他人的住宅享有占有、使用的用益物权，以满足生活居住的需要。",
        },
        {
          title: "第三百六十七条",
          content:
            ["设立居住权，当事人应当采用书面形式订立居住权合同。","居住权合同一般包括下列条款：","（一）当事人的姓名或者名称和住所；","（二）住宅的位置；","（三）居住的条件和要求；","（四）居住权期限；","（五）解决争议的方法。"],
        },
        {
          title: "第三百六十八条",
          content:
            "居住权无偿设立，但是当事人另有约定的除外。设立居住权的，应当向登记机构申请居住权登记。居住权自登记时设立。",
        },
        {
          title: "第三百六十九条",
          content:
            "居住权不得转让、继承。设立居住权的住宅不得出租，但是当事人另有约定的除外。",
        },
        {
            title: "第三百七十条",
            content:
              "居住权期限届满或者居住权人死亡的，居住权消灭。居住权消灭的，应当及时办理注销登记。",
          },
          {
            title: "第三百七十一条",
            content:
              "以遗嘱方式设立居住权的，参照适用本章的有关规定。",
          },
        ],
      },
    });