Page({
  data: {
    civil: [
      {
        title: "第一千零四十条",
        content: "本编调整因婚姻家庭产生的民事关系。",
      },
      {
        title: "第一千零四十一条",
        content: [
          "婚姻家庭受国家保护。",
          "实行婚姻自由、一夫一妻、男女平等的婚姻制度。",
          "保护妇女、未成年人、老年人、残疾人的合法权益。",
        ],
      },
      {
        title: "第一千零四十二条",
        content: [
          "禁止包办、买卖婚姻和其他干涉婚姻自由的行为。禁止借婚姻索取财物。",
          "禁止重婚。禁止有配偶者与他人同居。",
          "禁止家庭暴力。禁止家庭成员间的虐待和遗弃。",
        ],
      },
      {
        title: "第一千零四十三条",
        content: [
          "家庭应当树立优良家风，弘扬家庭美德，重视家庭文明建设。",
          "夫妻应当互相忠实，互相尊重，互相关爱；家庭成员应当敬老爱幼，互相帮助，维护平等、和睦、文明的婚姻家庭关系。",
        ],
      },
      {
        title: "第一千零四十四条",
        content: [
          "收养应当遵循最有利于被收养人的原则，保障被收养人和收养人的合法权益。",
          "禁止借收养名义买卖未成年人。",
        ],
      },
      {
        title: "第一千零四十五条",
        content: [
          "亲属包括配偶、血亲和姻亲。",
          "配偶、父母、子女、兄弟姐妹、祖父母、外祖父母、孙子女、外孙子女为近亲属。",
          "配偶、父母、子女和其他共同生活的近亲属为家庭成员。",
        ],
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
