Page({
  data: {
    civil: [
      {
        title: "第九百零四条",
        content:
          "仓储合同是保管人储存存货人交付的仓储物，存货人支付仓储费的合同。",
      },
      {
        title: "第九百零五条",
        content: "仓储合同自保管人和存货人意思表示一致时成立。",
      },
      {
        title: "第九百零六条",
        content: [
          "储存易燃、易爆、有毒、有腐蚀性、有放射性等危险物品或者易变质物品的，存货人应当说明该物品的性质，提供有关资料。",
          "存货人违反前款规定的，保管人可以拒收仓储物，也可以采取相应措施以避免损失的发生，因此产生的费用由存货人负担。",
          "保管人储存易燃、易爆、有毒、有腐蚀性、有放射性等危险物品的，应当具备相应的保管条件。",
        ],
      },
      {
        title: "第九百零七条",
        content:
          "保管人应当按照约定对入库仓储物进行验收。保管人验收时发现入库仓储物与约定不符合的，应当及时通知存货人。保管人验收后，发生仓储物的品种、数量、质量不符合约定的，保管人应当承担赔偿责任。",
      },
      {
        title: "第九百零八条",
        content: "存货人交付仓储物的，保管人应当出具仓单、入库单等凭证。",
      },
      {
        title: "第九百零九条",
        content: [
          "保管人应当在仓单上签名或者盖章。仓单包括下列事项：",
          "（一）存货人的姓名或者名称和住所；",
          "（二）仓储物的品种、数量、质量、包装及其件数和标记；",
          "（三）仓储物的损耗标准；",
          "（四）储存场所；",
          "（五）储存期限；",
          "（六）仓储费；",
          "（七）仓储物已经办理保险的，其保险金额、期间以及保险人的名称；",
          "（八）填发人、填发地和填发日期。",
        ],
      },
      {
        title: "第九百一十条",
        content:
          "仓单是提取仓储物的凭证。存货人或者仓单持有人在仓单上背书并经保管人签名或者盖章的，可以转让提取仓储物的权利。",
      },
      {
        title: "第九百一十一条",
        content:
          "保管人根据存货人或者仓单持有人的要求，应当同意其检查仓储物或者提取样品。",
      },
      {
        title: "第九百一十二条",
        content:
          "保管人发现入库仓储物有变质或者其他损坏的，应当及时通知存货人或者仓单持有人。",
      },
      {
        title: "第九百一十三条",
        content:
          "保管人发现入库仓储物有变质或者其他损坏，危及其他仓储物的安全和正常保管的，应当催告存货人或者仓单持有人作出必要的处置。因情况紧急，保管人可以作出必要的处置；但是，事后应当将该情况及时通知存货人或者仓单持有人。",
      },
      {
        title: "第九百一十四条",
        content:
          "当事人对储存期限没有约定或者约定不明确的，存货人或者仓单持有人可以随时提取仓储物，保管人也可以随时请求存货人或者仓单持有人提取仓储物，但是应当给予必要的准备时间。",
      },
      {
        title: "第九百一十五条",
        content:
          "储存期限届满，存货人或者仓单持有人应当凭仓单、入库单等提取仓储物。存货人或者仓单持有人逾期提取的，应当加收仓储费；提前提取的，不减收仓储费。",
      },
      {
        title: "第九百一十六条",
        content:
          "储存期限届满，存货人或者仓单持有人不提取仓储物的，保管人可以催告其在合理期限内提取；逾期不提取的，保管人可以提存仓储物。",
      },
      {
        title: "第九百一十七条",
        content:
          "储存期内，因保管不善造成仓储物毁损、灭失的，保管人应当承担赔偿责任。因仓储物本身的自然性质、包装不符合约定或者超过有效储存期造成仓储物变质、损坏的，保管人不承担赔偿责任。",
      },
      {
        title: "第九百一十八条",
        content: "本章没有规定的，适用保管合同的有关规定。",
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
