Page({
  data: {
    civil: [
      {
        title: "第一百七十六条",
        content:
          "民事主体依照法律规定或者按照当事人约定，履行民事义务，承担民事责任。",
      },
      {
        title: "第一百七十七条",
        content:
          "二人以上依法承担按份责任，能够确定责任大小的，各自承担相应的责任；难以确定责任大小的，平均承担责任。",
      },
      {
        title: "第一百七十八条",
        content: [
          "二人以上依法承担连带责任的，权利人有权请求部分或者全部连带责任人承担责任。",
          "连带责任人的责任份额根据各自责任大小确定；难以确定责任大小的，平均承担责任。实际承担责任超过自己责任份额的连带责任人，有权向其他连带责任人追偿。",
          "连带责任，由法律规定或者当事人约定。",
        ],
      },
      {
        title: "第一百七十九条",
        content: [
          "承担民事责任的方式主要有：",
          "（一）停止侵害；",
          "（二）排除妨碍；",
          "（三）消除危险；",
          "（四）返还财产；",
          "（五）恢复原状；",
          "（六）修理、重作、更换；",
          "（七）继续履行；",
          "（八）赔偿损失；",
          "（九）支付违约金；",
          "（十）消除影响、恢复名誉；",
          "（十一）赔礼道歉。",
          "法律规定惩罚性赔偿的，依照其规定。",
          "本条规定的承担民事责任的方式，可以单独适用，也可以合并适用。",
        ],
      },
      {
        title: "第一百八十条",
        content: [
          "因不可抗力不能履行民事义务的，不承担民事责任。法律另有规定的，依照其规定。",
          "不可抗力是不能预见、不能避免且不能克服的客观情况。",
        ],
      },
      {
        title: "第一百八十一条",
        content: [
          "因正当防卫造成损害的，不承担民事责任。",
          "正当防卫超过必要的限度，造成不应有的损害的，正当防卫人应当承担适当的民事责任。",
        ],
      },
      {
        title: "第一百八十二条",
        content: [
          "因紧急避险造成损害的，由引起险情发生的人承担民事责任。",
          "危险由自然原因引起的，紧急避险人不承担民事责任，可以给予适当补偿。",
          "紧急避险采取措施不当或者超过必要的限度，造成不应有的损害的，紧急避险人应当承担适当的民事责任。",
        ],
      },
      {
        title: "第一百八十三条",
        content:
          "因保护他人民事权益使自己受到损害的，由侵权人承担民事责任，受益人可以给予适当补偿。没有侵权人、侵权人逃逸或者无力承担民事责任，受害人请求补偿的，受益人应当给予适当补偿。",
      },
      {
        title: "第一百八十四条",
        content:
          "因自愿实施紧急救助行为造成受助人损害的，救助人不承担民事责任。",
      },
      {
        title: "第一百八十五条",
        content:
          "侵害英雄烈士等的姓名、肖像、名誉、荣誉，损害社会公共利益的，应当承担民事责任。",
      },
      {
        title: "第一百八十六条",
        content:
          "因当事人一方的违约行为，损害对方人身权益、财产权益的，受损害方有权选择请求其承担违约责任或者侵权责任。",
      },
      {
        title: "第一百八十七条",
        content:
          "民事主体因同一行为应当承担民事责任、行政责任和刑事责任的，承担行政责任或者刑事责任不影响承担民事责任；民事主体的财产不足以支付的，优先用于承担民事责任。",
      },
    ],
  },
  onLoad: function (options) {
    const { partIndex, chapterIndex } = options;
    this.setData({ partIndex, chapterIndex });
  },
});
