Page({
    data: {
      civil: [
        {
          title: "第五百七十七条",
          content:
            "当事人一方不履行合同义务或者履行合同义务不符合约定的，应当承担继续履行、采取补救措施或者赔偿损失等违约责任。",
        },
        {
          title: "第五百七十八条",
          content:
          "当事人一方明确表示或者以自己的行为表明不履行合同义务的，对方可以在履行期限届满前请求其承担违约责任。",
        },
        {
          title: "第五百七十九条",
          content:
            "当事人一方未支付价款、报酬、租金、利息，或者不履行其他金钱债务的，对方可以请求其支付。",
        },
        {
          title: "第五百八十条",
          content:
          ["当事人一方不履行非金钱债务或者履行非金钱债务不符合约定的，对方可以请求履行，但是有下列情形之一的除外：","（一）法律上或者事实上不能履行；","（二）债务的标的不适于强制履行或者履行费用过高；","（三）债权人在合理期限内未请求履行。","有前款规定的除外情形之一，致使不能实现合同目的的，人民法院或者仲裁机构可以根据当事人的请求终止合同权利义务关系，但是不影响违约责任的承担。"],
        },
        {
            title: "第五百八十一条",
            content:
              "当事人一方不履行债务或者履行债务不符合约定，根据债务的性质不得强制履行的，对方可以请求其负担由第三人替代履行的费用。",
          },
          {
            title: "第五百八十二条",
            content:
              "履行不符合约定的，应当按照当事人的约定承担违约责任。对违约责任没有约定或者约定不明确，依据本法第五百一十条的规定仍不能确定的，受损害方根据标的的性质以及损失的大小，可以合理选择请求对方承担修理、重作、更换、退货、减少价款或者报酬等违约责任。",
          },
          {
            title: "第五百八十三条",
            content:
              "当事人一方不履行合同义务或者履行合同义务不符合约定的，在履行义务或者采取补救措施后，对方还有其他损失的，应当赔偿损失。",
          },
          {
            title: "第五百八十四条",
            content:
              "当事人一方不履行合同义务或者履行合同义务不符合约定，造成对方损失的，损失赔偿额应当相当于因违约所造成的损失，包括合同履行后可以获得的利益；但是，不得超过违约一方订立合同时预见到或者应当预见到的因违约可能造成的损失。",
          },
          {
            title: "第五百八十五条",
            content:
            ["当事人可以约定一方违约时应当根据违约情况向对方支付一定数额的违约金，也可以约定因违约产生的损失赔偿额的计算方法。","约定的违约金低于造成的损失的，人民法院或者仲裁机构可以根据当事人的请求予以增加；约定的违约金过分高于造成的损失的，人民法院或者仲裁机构可以根据当事人的请求予以适当减少。","当事人就迟延履行约定违约金的，违约方支付违约金后，还应当履行债务。"],
          },
          {
            title: "第五百八十六条",
            content:
            ["当事人可以约定一方向对方给付定金作为债权的担保。定金合同自实际交付定金时成立。","定金的数额由当事人约定；但是，不得超过主合同标的额的百分之二十，超过部分不产生定金的效力。实际交付的定金数额多于或者少于约定数额的，视为变更约定的定金数额。"],
          },
          {
            title: "第五百八十七条",
            content:
              "债务人履行债务的，定金应当抵作价款或者收回。给付定金的一方不履行债务或者履行债务不符合约定，致使不能实现合同目的的，无权请求返还定金；收受定金的一方不履行债务或者履行债务不符合约定，致使不能实现合同目的的，应当双倍返还定金。",
          },
          {
            title: "第五百八十八条",
            content:
            ["当事人既约定违约金，又约定定金的，一方违约时，对方可以选择适用违约金或者定金条款。","定金不足以弥补一方违约造成的损失的，对方可以请求赔偿超过定金数额的损失。"],
          },
          {
            title: "第五百八十九条",
            content:
            ["债务人按照约定履行债务，债权人无正当理由拒绝受领的，债务人可以请求债权人赔偿增加的费用。","在债权人受领迟延期间，债务人无须支付利息。"],
          },
          {
            title: "第五百九十条",
            content:
            ["当事人一方因不可抗力不能履行合同的，根据不可抗力的影响，部分或者全部免除责任，但是法律另有规定的除外。因不可抗力不能履行合同的，应当及时通知对方，以减轻可能给对方造成的损失，并应当在合理期限内提供证明。","当事人迟延履行后发生不可抗力的，不免除其违约责任。"],
          },
          {
            title: "第五百九十一条",
            content:
            ["当事人一方违约后，对方应当采取适当措施防止损失的扩大；没有采取适当措施致使损失扩大的，不得就扩大的损失请求赔偿。","当事人因防止损失扩大而支出的合理费用，由违约方负担。"],
          },
          {
            title: "第五百九十二条",
            content:
            ["当事人都违反合同的，应当各自承担相应的责任。","当事人一方违约造成对方损失，对方对损失的发生有过错的，可以减少相应的损失赔偿额。"],
          },
          {
            title: "第五百九十三条",
            content:
            "当事人一方因第三人的原因造成违约的，应当依法向对方承担违约责任。当事人一方和第三人之间的纠纷，依照法律规定或者按照约定处理。",
          },
          {
            title: "第五百九十四条",
            content:
            "因国际货物买卖合同和技术进出口合同争议提起诉讼或者申请仲裁的时效期间为四年。",
          },
        ],
      },
    });